---
kind: enumMember
id: F:Autodesk.Revit.DB.FramingShapeClassification.Oval
enum: Autodesk.Revit.DB.FramingShapeClassification
source: html/4f5071f8-2c67-fbb7-b684-dd28dd0173f2.htm
---
# Autodesk.Revit.DB.FramingShapeClassification.Oval